blog/2021/lc-96-unique-binary-search-trees.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 10:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC96. 不同的二叉搜索树</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC96. 不同的二叉搜索树</h1>
</header><p>
今天思考 LeetCode 题目：不同的二叉搜索树<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-org5703549" class="outline-2">
<h2 id="org5703549">题目描述</h2>
<div class="outline-text-2" id="text-org5703549">
<p>
给一个整数 <code>n</code> ，求恰由 <code>n</code> 个节点组成且节点值从 <code>1</code> 到 <code>n</code> 互不相同的 <b>二叉搜索树</b> 有多少种？返回满足题意的二叉搜索树的种数。
</p>
</div>
</div>

<div id="outline-container-org968e799" class="outline-2">
<h2 id="org968e799">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-org968e799">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {number} n</span>
<span style="color: #7c7565;"> * @return {number}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">var</span> <span style="color: #aaca86;">numTrees</span> = <span style="color: #91a0b3;">function</span>(<span style="color: #aaca86;">n</span>) {
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">G</span> = <span style="color: #91a0b3;">new</span> <span style="color: #ad8572;">Array</span>(n + 1).fill(0);
    G[0] = 1;
    G[1] = 1;

    <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 2; i &lt;= n; ++i) {
        <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">j</span> = 1; j &lt;= i; ++j) {
            G[i] += G[j - 1] * G[i - j];
        }
    }
    <span style="color: #91a0b3;">return</span> G[n];
};
</pre>
</div>

<p>
使用了动态规划的办法。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/unique-binary-search-trees/">https://leetcode-cn.com/problems/unique-binary-search-trees/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/unique-binary-search-trees/solution/bu-tong-de-er-cha-sou-suo-shu-by-leetcode-solution/">https://leetcode-cn.com/problems/unique-binary-search-trees/solution/bu-tong-de-er-cha-sou-suo-shu-by-leetcode-solution/</a></p></div></div>


</div>
</div></div>
</body>
</html>